//Numbers 表保存数字的值及其频率。 
//
// +----------+-------------+
//|  Number  |  Frequency  |
//+----------+-------------|
//|  0       |  7          |
//|  1       |  1          |
//|  2       |  3          |
//|  3       |  1          |
//+----------+-------------+
// 
//
// 在此表中，数字为 0, 0, 0, 0, 0, 0, 0, 1, 2, 2, 2, 3，所以中位数是 (0 + 0) / 2 = 0。 
//
// +--------+
//| median |
//+--------|
//| 0.0000 |
//+--------+
// 
//
// 请编写一个查询来查找所有数字的中位数并将结果命名为 median 。 
//


//There is no code of C++ type for this problem